{
  "metadata": {
    "total_parameters": 3030371328,
    "total_size": 6060742656
  },
  "weight_map": {
    "model.embed_tokens.weight": "model-00001-of-00002.safetensors",
    "model.layers.0.input_layernorm.bias": "model-00001-of-00002.safetensors",
    "model.layers.0.input_layernorm.weight": "model-00001-of-00002.safetensors",
    "model.layers.0.mlp.c_fc.bias": "model-00001-of-00002.safetensors",
    "model.layers.0.mlp.c_fc.weight": "model-00001-of-00002.safetensors",
    "model.layers.0.mlp.c_proj.bias": "model-00001-of-00002.safetensors",
    "model.layers.0.mlp.c_proj.weight": "model-00001-of-00002.safetensors",
    "model.layers.0.post_attention_layernorm.bias": "model-00001-of-00002.safetensors",
    "model.layers.0.post_attention_layernorm.weight": "model-00001-of-00002.safetensors",
    "model.layers.0.self_attn.k_proj.bias": "model-00001-of-00002.safetensors",
    "model.layers.0.self_attn.k_proj.weight": "model-00001-of-00002.safetensors",
    "model.layers.0.self_attn.o_proj.bias": "model-00001-of-00002.safetensors",
    "model.layers.0.self_attn.o_proj.weight": "model-00001-of-00002.safetensors",
    "model.layers.0.self_attn.q_proj.bias": "model-00001-of-00002.safetensors",
    "model.layers.0.self_attn.q_proj.weight": "model-00001-of-00002.safetensors",
    "model.layers.0.self_attn.v_proj.bias": "model-00001-of-00002.safetensors",
    "model.layers.0.self_attn.v_proj.weight": "model-00001-of-00002.safetensors",
    "model.layers.1.input_layernorm.bias": "model-00001-of-00002.safetensors",
    "model.layers.1.input_layernorm.weight": "model-00001-of-00002.safetensors",
    "model.layers.1.mlp.c_fc.bias": "model-00001-of-00002.safetensors",
    "model.layers.1.mlp.c_fc.weight": "model-00001-of-00002.safetensors",
    "model.layers.1.mlp.c_proj.bias": "model-00001-of-00002.safetensors",
    "model.layers.1.mlp.c_proj.weight": "model-00001-of-00002.safetensors",
    "model.layers.1.post_attention_layernorm.bias": "model-00001-of-00002.safetensors",
    "model.layers.1.post_attention_layernorm.weight": "model-00001-of-00002.safetensors",
    "model.layers.1.self_attn.k_proj.bias": "model-00001-of-00002.safetensors",
    "model.layers.1.self_attn.k_proj.weight": "model-00001-of-00002.safetensors",
    "model.layers.1.self_attn.o_proj.bias": "model-00001-of-00002.safetensors",
    "model.layers.1.self_attn.o_proj.weight": "model-00001-of-00002.safetensors",
    "model.layers.1.self_attn.q_proj.bias": "model-00001-of-00002.safetensors",
    "model.layers.1.self_attn.q_proj.weight": "model-00001-of-00002.safetensors",
    "model.layers.1.self_attn.v_proj.bias": "model-00001-of-00002.safetensors",
    "model.layers.1.self_attn.v_proj.weight": "model-00001-of-00002.safetensors",
    "model.layers.10.input_layernorm.bias": "model-00001-of-00002.safetensors",
    "model.layers.10.input_layernorm.weight": "model-00001-of-00002.safetensors",
    "model.layers.10.mlp.c_fc.bias": "model-00001-of-00002.safetensors",
    "model.layers.10.mlp.c_fc.weight": "model-00001-of-00002.safetensors",
    "model.layers.10.mlp.c_proj.bias": "model-00001-of-00002.safetensors",
    "model.layers.10.mlp.c_proj.weight": "model-00001-of-00002.safetensors",
    "model.layers.10.post_attention_layernorm.bias": "model-00001-of-00002.safetensors",
    "model.layers.10.post_attention_layernorm.weight": "model-00001-of-00002.safetensors",
    "model.layers.10.self_attn.k_proj.bias": "model-00001-of-00002.safetensors",
    "model.layers.10.self_attn.k_proj.weight": "model-00001-of-00002.safetensors",
    "model.layers.10.self_attn.o_proj.bias": "model-00001-of-00002.safetensors",
    "model.layers.10.self_attn.o_proj.weight": "model-00001-of-00002.safetensors",
    "model.layers.10.self_attn.q_proj.bias": "model-00001-of-00002.safetensors",
    "model.layers.10.self_attn.q_proj.weight": "model-00001-of-00002.safetensors",
    "model.layers.10.self_attn.v_proj.bias": "model-00001-of-00002.safetensors",
    "model.layers.10.self_attn.v_proj.weight": "model-00001-of-00002.safetensors",
    "model.layers.11.input_layernorm.bias": "model-00001-of-00002.safetensors",
    "model.layers.11.input_layernorm.weight": "model-00001-of-00002.safetensors",
    "model.layers.11.mlp.c_fc.bias": "model-00001-of-00002.safetensors",
    "model.layers.11.mlp.c_fc.weight": "model-00001-of-00002.safetensors",
    "model.layers.11.mlp.c_proj.bias": "model-00001-of-00002.safetensors",
    "model.layers.11.mlp.c_proj.weight": "model-00001-of-00002.safetensors",
    "model.layers.11.post_attention_layernorm.bias": "model-00001-of-00002.safetensors",
    "model.layers.11.post_attention_layernorm.weight": "model-00001-of-00002.safetensors",
    "model.layers.11.self_attn.k_proj.bias": "model-00001-of-00002.safetensors",
    "model.layers.11.self_attn.k_proj.weight": "model-00001-of-00002.safetensors",
    "model.layers.11.self_attn.o_proj.bias": "model-00001-of-00002.safetensors",
    "model.layers.11.self_attn.o_proj.weight": "model-00001-of-00002.safetensors",
    "model.layers.11.self_attn.q_proj.bias": "model-00001-of-00002.safetensors",
    "model.layers.11.self_attn.q_proj.weight": "model-00001-of-00002.safetensors",
    "model.layers.11.self_attn.v_proj.bias": "model-00001-of-00002.safetensors",
    "model.layers.11.self_attn.v_proj.weight": "model-00001-of-00002.safetensors",
    "model.layers.12.input_layernorm.bias": "model-00001-of-00002.safetensors",
    "model.layers.12.input_layernorm.weight": "model-00001-of-00002.safetensors",
    "model.layers.12.mlp.c_fc.bias": "model-00001-of-00002.safetensors",
    "model.layers.12.mlp.c_fc.weight": "model-00001-of-00002.safetensors",
    "model.layers.12.mlp.c_proj.bias": "model-00001-of-00002.safetensors",
    "model.layers.12.mlp.c_proj.weight": "model-00001-of-00002.safetensors",
    "model.layers.12.post_attention_layernorm.bias": "model-00001-of-00002.safetensors",
    "model.layers.12.post_attention_layernorm.weight": "model-00001-of-00002.safetensors",
    "model.layers.12.self_attn.k_proj.bias": "model-00001-of-00002.safetensors",
    "model.layers.12.self_attn.k_proj.weight": "model-00001-of-00002.safetensors",
    "model.layers.12.self_attn.o_proj.bias": "model-00001-of-00002.safetensors",
    "model.layers.12.self_attn.o_proj.weight": "model-00001-of-00002.safetensors",
    "model.layers.12.self_attn.q_proj.bias": "model-00001-of-00002.safetensors",
    "model.layers.12.self_attn.q_proj.weight": "model-00001-of-00002.safetensors",
    "model.layers.12.self_attn.v_proj.bias": "model-00001-of-00002.safetensors",
    "model.layers.12.self_attn.v_proj.weight": "model-00001-of-00002.safetensors",
    "model.layers.13.input_layernorm.bias": "model-00001-of-00002.safetensors",
    "model.layers.13.input_layernorm.weight": "model-00001-of-00002.safetensors",
    "model.layers.13.mlp.c_fc.bias": "model-00001-of-00002.safetensors",
    "model.layers.13.mlp.c_fc.weight": "model-00001-of-00002.safetensors",
    "model.layers.13.mlp.c_proj.bias": "model-00001-of-00002.safetensors",
    "model.layers.13.mlp.c_proj.weight": "model-00001-of-00002.safetensors",
    "model.layers.13.post_attention_layernorm.bias": "model-00001-of-00002.safetensors",
    "model.layers.13.post_attention_layernorm.weight": "model-00001-of-00002.safetensors",
    "model.layers.13.self_attn.k_proj.bias": "model-00001-of-00002.safetensors",
    "model.layers.13.self_attn.k_proj.weight": "model-00001-of-00002.safetensors",
    "model.layers.13.self_attn.o_proj.bias": "model-00001-of-00002.safetensors",
    "model.layers.13.self_attn.o_proj.weight": "model-00001-of-00002.safetensors",
    "model.layers.13.self_attn.q_proj.bias": "model-00001-of-00002.safetensors",
    "model.layers.13.self_attn.q_proj.weight": "model-00001-of-00002.safetensors",
    "model.layers.13.self_attn.v_proj.bias": "model-00001-of-00002.safetensors",
    "model.layers.13.self_attn.v_proj.weight": "model-00001-of-00002.safetensors",
    "model.layers.14.input_layernorm.bias": "model-00001-of-00002.safetensors",
    "model.layers.14.input_layernorm.weight": "model-00001-of-00002.safetensors",
    "model.layers.14.mlp.c_fc.bias": "model-00001-of-00002.safetensors",
    "model.layers.14.mlp.c_fc.weight": "model-00001-of-00002.safetensors",
    "model.layers.14.mlp.c_proj.bias": "model-00001-of-00002.safetensors",
    "model.layers.14.mlp.c_proj.weight": "model-00001-of-00002.safetensors",
    "model.layers.14.post_attention_layernorm.bias": "model-00001-of-00002.safetensors",
    "model.layers.14.post_attention_layernorm.weight": "model-00001-of-00002.safetensors",
    "model.layers.14.self_attn.k_proj.bias": "model-00001-of-00002.safetensors",
    "model.layers.14.self_attn.k_proj.weight": "model-00001-of-00002.safetensors",
    "model.layers.14.self_attn.o_proj.bias": "model-00001-of-00002.safetensors",
    "model.layers.14.self_attn.o_proj.weight": "model-00001-of-00002.safetensors",
    "model.layers.14.self_attn.q_proj.bias": "model-00001-of-00002.safetensors",
    "model.layers.14.self_attn.q_proj.weight": "model-00001-of-00002.safetensors",
    "model.layers.14.self_attn.v_proj.bias": "model-00001-of-00002.safetensors",
    "model.layers.14.self_attn.v_proj.weight": "model-00001-of-00002.safetensors",
    "model.layers.15.input_layernorm.bias": "model-00001-of-00002.safetensors",
    "model.layers.15.input_layernorm.weight": "model-00001-of-00002.safetensors",
    "model.layers.15.mlp.c_fc.bias": "model-00001-of-00002.safetensors",
    "model.layers.15.mlp.c_fc.weight": "model-00001-of-00002.safetensors",
    "model.layers.15.mlp.c_proj.bias": "model-00001-of-00002.safetensors",
    "model.layers.15.mlp.c_proj.weight": "model-00001-of-00002.safetensors",
    "model.layers.15.post_attention_layernorm.bias": "model-00001-of-00002.safetensors",
    "model.layers.15.post_attention_layernorm.weight": "model-00001-of-00002.safetensors",
    "model.layers.15.self_attn.k_proj.bias": "model-00001-of-00002.safetensors",
    "model.layers.15.self_attn.k_proj.weight": "model-00001-of-00002.safetensors",
    "model.layers.15.self_attn.o_proj.bias": "model-00001-of-00002.safetensors",
    "model.layers.15.self_attn.o_proj.weight": "model-00001-of-00002.safetensors",
    "model.layers.15.self_attn.q_proj.bias": "model-00001-of-00002.safetensors",
    "model.layers.15.self_attn.q_proj.weight": "model-00001-of-00002.safetensors",
    "model.layers.15.self_attn.v_proj.bias": "model-00001-of-00002.safetensors",
    "model.layers.15.self_attn.v_proj.weight": "model-00001-of-00002.safetensors",
    "model.layers.16.input_layernorm.bias": "model-00001-of-00002.safetensors",
    "model.layers.16.input_layernorm.weight": "model-00001-of-00002.safetensors",
    "model.layers.16.mlp.c_fc.bias": "model-00001-of-00002.safetensors",
    "model.layers.16.mlp.c_fc.weight": "model-00001-of-00002.safetensors",
    "model.layers.16.mlp.c_proj.bias": "model-00001-of-00002.safetensors",
    "model.layers.16.mlp.c_proj.weight": "model-00001-of-00002.safetensors",
    "model.layers.16.post_attention_layernorm.bias": "model-00001-of-00002.safetensors",
    "model.layers.16.post_attention_layernorm.weight": "model-00001-of-00002.safetensors",
    "model.layers.16.self_attn.k_proj.bias": "model-00001-of-00002.safetensors",
    "model.layers.16.self_attn.k_proj.weight": "model-00001-of-00002.safetensors",
    "model.layers.16.self_attn.o_proj.bias": "model-00001-of-00002.safetensors",
    "model.layers.16.self_attn.o_proj.weight": "model-00001-of-00002.safetensors",
    "model.layers.16.self_attn.q_proj.bias": "model-00001-of-00002.safetensors",
    "model.layers.16.self_attn.q_proj.weight": "model-00001-of-00002.safetensors",
    "model.layers.16.self_attn.v_proj.bias": "model-00001-of-00002.safetensors",
    "model.layers.16.self_attn.v_proj.weight": "model-00001-of-00002.safetensors",
    "model.layers.17.input_layernorm.bias": "model-00001-of-00002.safetensors",
    "model.layers.17.input_layernorm.weight": "model-00001-of-00002.safetensors",
    "model.layers.17.mlp.c_fc.bias": "model-00001-of-00002.safetensors",
    "model.layers.17.mlp.c_fc.weight": "model-00001-of-00002.safetensors",
    "model.layers.17.mlp.c_proj.bias": "model-00001-of-00002.safetensors",
    "model.layers.17.mlp.c_proj.weight": "model-00001-of-00002.safetensors",
    "model.layers.17.post_attention_layernorm.bias": "model-00001-of-00002.safetensors",
    "model.layers.17.post_attention_layernorm.weight": "model-00001-of-00002.safetensors",
    "model.layers.17.self_attn.k_proj.bias": "model-00001-of-00002.safetensors",
    "model.layers.17.self_attn.k_proj.weight": "model-00001-of-00002.safetensors",
    "model.layers.17.self_attn.o_proj.bias": "model-00001-of-00002.safetensors",
    "model.layers.17.self_attn.o_proj.weight": "model-00001-of-00002.safetensors",
    "model.layers.17.self_attn.q_proj.bias": "model-00001-of-00002.safetensors",
    "model.layers.17.self_attn.q_proj.weight": "model-00001-of-00002.safetensors",
    "model.layers.17.self_attn.v_proj.bias": "model-00001-of-00002.safetensors",
    "model.layers.17.self_attn.v_proj.weight": "model-00001-of-00002.safetensors",
    "model.layers.18.input_layernorm.bias": "model-00001-of-00002.safetensors",
    "model.layers.18.input_layernorm.weight": "model-00001-of-00002.safetensors",
    "model.layers.18.mlp.c_fc.bias": "model-00001-of-00002.safetensors",
    "model.layers.18.mlp.c_fc.weight": "model-00001-of-00002.safetensors",
    "model.layers.18.mlp.c_proj.bias": "model-00001-of-00002.safetensors",
    "model.layers.18.mlp.c_proj.weight": "model-00001-of-00002.safetensors",
    "model.layers.18.post_attention_layernorm.bias": "model-00001-of-00002.safetensors",
    "model.layers.18.post_attention_layernorm.weight": "model-00001-of-00002.safetensors",
    "model.layers.18.self_attn.k_proj.bias": "model-00001-of-00002.safetensors",
    "model.layers.18.self_attn.k_proj.weight": "model-00001-of-00002.safetensors",
    "model.layers.18.self_attn.o_proj.bias": "model-00001-of-00002.safetensors",
    "model.layers.18.self_attn.o_proj.weight": "model-00001-of-00002.safetensors",
    "model.layers.18.self_attn.q_proj.bias": "model-00001-of-00002.safetensors",
    "model.layers.18.self_attn.q_proj.weight": "model-00001-of-00002.safetensors",
    "model.layers.18.self_attn.v_proj.bias": "model-00001-of-00002.safetensors",
    "model.layers.18.self_attn.v_proj.weight": "model-00001-of-00002.safetensors",
    "model.layers.19.input_layernorm.bias": "model-00001-of-00002.safetensors",
    "model.layers.19.input_layernorm.weight": "model-00001-of-00002.safetensors",
    "model.layers.19.mlp.c_fc.bias": "model-00001-of-00002.safetensors",
    "model.layers.19.mlp.c_fc.weight": "model-00001-of-00002.safetensors",
    "model.layers.19.mlp.c_proj.bias": "model-00001-of-00002.safetensors",
    "model.layers.19.mlp.c_proj.weight": "model-00001-of-00002.safetensors",
    "model.layers.19.post_attention_layernorm.bias": "model-00001-of-00002.safetensors",
    "model.layers.19.post_attention_layernorm.weight": "model-00001-of-00002.safetensors",
    "model.layers.19.self_attn.k_proj.bias": "model-00001-of-00002.safetensors",
    "model.layers.19.self_attn.k_proj.weight": "model-00001-of-00002.safetensors",
    "model.layers.19.self_attn.o_proj.bias": "model-00001-of-00002.safetensors",
    "model.layers.19.self_attn.o_proj.weight": "model-00001-of-00002.safetensors",
    "model.layers.19.self_attn.q_proj.bias": "model-00001-of-00002.safetensors",
    "model.layers.19.self_attn.q_proj.weight": "model-00001-of-00002.safetensors",
    "model.layers.19.self_attn.v_proj.bias": "model-00001-of-00002.safetensors",
    "model.layers.19.self_attn.v_proj.weight": "model-00001-of-00002.safetensors",
    "model.layers.2.input_layernorm.bias": "model-00001-of-00002.safetensors",
    "model.layers.2.input_layernorm.weight": "model-00001-of-00002.safetensors",
    "model.layers.2.mlp.c_fc.bias": "model-00001-of-00002.safetensors",
    "model.layers.2.mlp.c_fc.weight": "model-00001-of-00002.safetensors",
    "model.layers.2.mlp.c_proj.bias": "model-00001-of-00002.safetensors",
    "model.layers.2.mlp.c_proj.weight": "model-00001-of-00002.safetensors",
    "model.layers.2.post_attention_layernorm.bias": "model-00001-of-00002.safetensors",
    "model.layers.2.post_attention_layernorm.weight": "model-00001-of-00002.safetensors",
    "model.layers.2.self_attn.k_proj.bias": "model-00001-of-00002.safetensors",
    "model.layers.2.self_attn.k_proj.weight": "model-00001-of-00002.safetensors",
    "model.layers.2.self_attn.o_proj.bias": "model-00001-of-00002.safetensors",
    "model.layers.2.self_attn.o_proj.weight": "model-00001-of-00002.safetensors",
    "model.layers.2.self_attn.q_proj.bias": "model-00001-of-00002.safetensors",
    "model.layers.2.self_attn.q_proj.weight": "model-00001-of-00002.safetensors",
    "model.layers.2.self_attn.v_proj.bias": "model-00001-of-00002.safetensors",
    "model.layers.2.self_attn.v_proj.weight": "model-00001-of-00002.safetensors",
    "model.layers.20.input_layernorm.bias": "model-00001-of-00002.safetensors",
    "model.layers.20.input_layernorm.weight": "model-00001-of-00002.safetensors",
    "model.layers.20.mlp.c_fc.bias": "model-00001-of-00002.safetensors",
    "model.layers.20.mlp.c_fc.weight": "model-00001-of-00002.safetensors",
    "model.layers.20.mlp.c_proj.bias": "model-00001-of-00002.safetensors",
    "model.layers.20.mlp.c_proj.weight": "model-00001-of-00002.safetensors",
    "model.layers.20.post_attention_layernorm.bias": "model-00001-of-00002.safetensors",
    "model.layers.20.post_attention_layernorm.weight": "model-00001-of-00002.safetensors",
    "model.layers.20.self_attn.k_proj.bias": "model-00001-of-00002.safetensors",
    "model.layers.20.self_attn.k_proj.weight": "model-00001-of-00002.safetensors",
    "model.layers.20.self_attn.o_proj.bias": "model-00001-of-00002.safetensors",
    "model.layers.20.self_attn.o_proj.weight": "model-00001-of-00002.safetensors",
    "model.layers.20.self_attn.q_proj.bias": "model-00001-of-00002.safetensors",
    "model.layers.20.self_attn.q_proj.weight": "model-00001-of-00002.safetensors",
    "model.layers.20.self_attn.v_proj.bias": "model-00001-of-00002.safetensors",
    "model.layers.20.self_attn.v_proj.weight": "model-00001-of-00002.safetensors",
    "model.layers.21.input_layernorm.bias": "model-00001-of-00002.safetensors",
    "model.layers.21.input_layernorm.weight": "model-00001-of-00002.safetensors",
    "model.layers.21.mlp.c_fc.bias": "model-00001-of-00002.safetensors",
    "model.layers.21.mlp.c_fc.weight": "model-00001-of-00002.safetensors",
    "model.layers.21.mlp.c_proj.bias": "model-00001-of-00002.safetensors",
    "model.layers.21.mlp.c_proj.weight": "model-00001-of-00002.safetensors",
    "model.layers.21.post_attention_layernorm.bias": "model-00001-of-00002.safetensors",
    "model.layers.21.post_attention_layernorm.weight": "model-00001-of-00002.safetensors",
    "model.layers.21.self_attn.k_proj.bias": "model-00001-of-00002.safetensors",
    "model.layers.21.self_attn.k_proj.weight": "model-00001-of-00002.safetensors",
    "model.layers.21.self_attn.o_proj.bias": "model-00001-of-00002.safetensors",
    "model.layers.21.self_attn.o_proj.weight": "model-00001-of-00002.safetensors",
    "model.layers.21.self_attn.q_proj.bias": "model-00001-of-00002.safetensors",
    "model.layers.21.self_attn.q_proj.weight": "model-00001-of-00002.safetensors",
    "model.layers.21.self_attn.v_proj.bias": "model-00001-of-00002.safetensors",
    "model.layers.21.self_attn.v_proj.weight": "model-00001-of-00002.safetensors",
    "model.layers.22.input_layernorm.bias": "model-00001-of-00002.safetensors",
    "model.layers.22.input_layernorm.weight": "model-00001-of-00002.safetensors",
    "model.layers.22.mlp.c_fc.bias": "model-00001-of-00002.safetensors",
    "model.layers.22.mlp.c_fc.weight": "model-00001-of-00002.safetensors",
    "model.layers.22.mlp.c_proj.bias": "model-00001-of-00002.safetensors",
    "model.layers.22.mlp.c_proj.weight": "model-00001-of-00002.safetensors",
    "model.layers.22.post_attention_layernorm.bias": "model-00001-of-00002.safetensors",
    "model.layers.22.post_attention_layernorm.weight": "model-00001-of-00002.safetensors",
    "model.layers.22.self_attn.k_proj.bias": "model-00001-of-00002.safetensors",
    "model.layers.22.self_attn.k_proj.weight": "model-00001-of-00002.safetensors",
    "model.layers.22.self_attn.o_proj.bias": "model-00001-of-00002.safetensors",
    "model.layers.22.self_attn.o_proj.weight": "model-00001-of-00002.safetensors",
    "model.layers.22.self_attn.q_proj.bias": "model-00001-of-00002.safetensors",
    "model.layers.22.self_attn.q_proj.weight": "model-00001-of-00002.safetensors",
    "model.layers.22.self_attn.v_proj.bias": "model-00001-of-00002.safetensors",
    "model.layers.22.self_attn.v_proj.weight": "model-00001-of-00002.safetensors",
    "model.layers.23.input_layernorm.bias": "model-00001-of-00002.safetensors",
    "model.layers.23.input_layernorm.weight": "model-00001-of-00002.safetensors",
    "model.layers.23.mlp.c_fc.bias": "model-00001-of-00002.safetensors",
    "model.layers.23.mlp.c_fc.weight": "model-00001-of-00002.safetensors",
    "model.layers.23.mlp.c_proj.bias": "model-00001-of-00002.safetensors",
    "model.layers.23.mlp.c_proj.weight": "model-00001-of-00002.safetensors",
    "model.layers.23.post_attention_layernorm.bias": "model-00001-of-00002.safetensors",
    "model.layers.23.post_attention_layernorm.weight": "model-00001-of-00002.safetensors",
    "model.layers.23.self_attn.k_proj.bias": "model-00001-of-00002.safetensors",
    "model.layers.23.self_attn.k_proj.weight": "model-00001-of-00002.safetensors",
    "model.layers.23.self_attn.o_proj.bias": "model-00001-of-00002.safetensors",
    "model.layers.23.self_attn.o_proj.weight": "model-00001-of-00002.safetensors",
    "model.layers.23.self_attn.q_proj.bias": "model-00001-of-00002.safetensors",
    "model.layers.23.self_attn.q_proj.weight": "model-00001-of-00002.safetensors",
    "model.layers.23.self_attn.v_proj.bias": "model-00001-of-00002.safetensors",
    "model.layers.23.self_attn.v_proj.weight": "model-00001-of-00002.safetensors",
    "model.layers.24.input_layernorm.bias": "model-00002-of-00002.safetensors",
    "model.layers.24.input_layernorm.weight": "model-00002-of-00002.safetensors",
    "model.layers.24.mlp.c_fc.bias": "model-00002-of-00002.safetensors",
    "model.layers.24.mlp.c_fc.weight": "model-00002-of-00002.safetensors",
    "model.layers.24.mlp.c_proj.bias": "model-00002-of-00002.safetensors",
    "model.layers.24.mlp.c_proj.weight": "model-00002-of-00002.safetensors",
    "model.layers.24.post_attention_layernorm.bias": "model-00002-of-00002.safetensors",
    "model.layers.24.post_attention_layernorm.weight": "model-00002-of-00002.safetensors",
    "model.layers.24.self_attn.k_proj.bias": "model-00001-of-00002.safetensors",
    "model.layers.24.self_attn.k_proj.weight": "model-00001-of-00002.safetensors",
    "model.layers.24.self_attn.o_proj.bias": "model-00001-of-00002.safetensors",
    "model.layers.24.self_attn.o_proj.weight": "model-00001-of-00002.safetensors",
    "model.layers.24.self_attn.q_proj.bias": "model-00001-of-00002.safetensors",
    "model.layers.24.self_attn.q_proj.weight": "model-00001-of-00002.safetensors",
    "model.layers.24.self_attn.v_proj.bias": "model-00001-of-00002.safetensors",
    "model.layers.24.self_attn.v_proj.weight": "model-00001-of-00002.safetensors",
    "model.layers.25.input_layernorm.bias": "model-00002-of-00002.safetensors",
    "model.layers.25.input_layernorm.weight": "model-00002-of-00002.safetensors",
    "model.layers.25.mlp.c_fc.bias": "model-00002-of-00002.safetensors",
    "model.layers.25.mlp.c_fc.weight": "model-00002-of-00002.safetensors",
    "model.layers.25.mlp.c_proj.bias": "model-00002-of-00002.safetensors",
    "model.layers.25.mlp.c_proj.weight": "model-00002-of-00002.safetensors",
    "model.layers.25.post_attention_layernorm.bias": "model-00002-of-00002.safetensors",
    "model.layers.25.post_attention_layernorm.weight": "model-00002-of-00002.safetensors",
    "model.layers.25.self_attn.k_proj.bias": "model-00002-of-00002.safetensors",
    "model.layers.25.self_attn.k_proj.weight": "model-00002-of-00002.safetensors",
    "model.layers.25.self_attn.o_proj.bias": "model-00002-of-00002.safetensors",
    "model.layers.25.self_attn.o_proj.weight": "model-00002-of-00002.safetensors",
    "model.layers.25.self_attn.q_proj.bias": "model-00002-of-00002.safetensors",
    "model.layers.25.self_attn.q_proj.weight": "model-00002-of-00002.safetensors",
    "model.layers.25.self_attn.v_proj.bias": "model-00002-of-00002.safetensors",
    "model.layers.25.self_attn.v_proj.weight": "model-00002-of-00002.safetensors",
    "model.layers.26.input_layernorm.bias": "model-00002-of-00002.safetensors",
    "model.layers.26.input_layernorm.weight": "model-00002-of-00002.safetensors",
    "model.layers.26.mlp.c_fc.bias": "model-00002-of-00002.safetensors",
    "model.layers.26.mlp.c_fc.weight": "model-00002-of-00002.safetensors",
    "model.layers.26.mlp.c_proj.bias": "model-00002-of-00002.safetensors",
    "model.layers.26.mlp.c_proj.weight": "model-00002-of-00002.safetensors",
    "model.layers.26.post_attention_layernorm.bias": "model-00002-of-00002.safetensors",
    "model.layers.26.post_attention_layernorm.weight": "model-00002-of-00002.safetensors",
    "model.layers.26.self_attn.k_proj.bias": "model-00002-of-00002.safetensors",
    "model.layers.26.self_attn.k_proj.weight": "model-00002-of-00002.safetensors",
    "model.layers.26.self_attn.o_proj.bias": "model-00002-of-00002.safetensors",
    "model.layers.26.self_attn.o_proj.weight": "model-00002-of-00002.safetensors",
    "model.layers.26.self_attn.q_proj.bias": "model-00002-of-00002.safetensors",
    "model.layers.26.self_attn.q_proj.weight": "model-00002-of-00002.safetensors",
    "model.layers.26.self_attn.v_proj.bias": "model-00002-of-00002.safetensors",
    "model.layers.26.self_attn.v_proj.weight": "model-00002-of-00002.safetensors",
    "model.layers.27.input_layernorm.bias": "model-00002-of-00002.safetensors",
    "model.layers.27.input_layernorm.weight": "model-00002-of-00002.safetensors",
    "model.layers.27.mlp.c_fc.bias": "model-00002-of-00002.safetensors",
    "model.layers.27.mlp.c_fc.weight": "model-00002-of-00002.safetensors",
    "model.layers.27.mlp.c_proj.bias": "model-00002-of-00002.safetensors",
    "model.layers.27.mlp.c_proj.weight": "model-00002-of-00002.safetensors",
    "model.layers.27.post_attention_layernorm.bias": "model-00002-of-00002.safetensors",
    "model.layers.27.post_attention_layernorm.weight": "model-00002-of-00002.safetensors",
    "model.layers.27.self_attn.k_proj.bias": "model-00002-of-00002.safetensors",
    "model.layers.27.self_attn.k_proj.weight": "model-00002-of-00002.safetensors",
    "model.layers.27.self_attn.o_proj.bias": "model-00002-of-00002.safetensors",
    "model.layers.27.self_attn.o_proj.weight": "model-00002-of-00002.safetensors",
    "model.layers.27.self_attn.q_proj.bias": "model-00002-of-00002.safetensors",
    "model.layers.27.self_attn.q_proj.weight": "model-00002-of-00002.safetensors",
    "model.layers.27.self_attn.v_proj.bias": "model-00002-of-00002.safetensors",
    "model.layers.27.self_attn.v_proj.weight": "model-00002-of-00002.safetensors",
    "model.layers.28.input_layernorm.bias": "model-00002-of-00002.safetensors",
    "model.layers.28.input_layernorm.weight": "model-00002-of-00002.safetensors",
    "model.layers.28.mlp.c_fc.bias": "model-00002-of-00002.safetensors",
    "model.layers.28.mlp.c_fc.weight": "model-00002-of-00002.safetensors",
    "model.layers.28.mlp.c_proj.bias": "model-00002-of-00002.safetensors",
    "model.layers.28.mlp.c_proj.weight": "model-00002-of-00002.safetensors",
    "model.layers.28.post_attention_layernorm.bias": "model-00002-of-00002.safetensors",
    "model.layers.28.post_attention_layernorm.weight": "model-00002-of-00002.safetensors",
    "model.layers.28.self_attn.k_proj.bias": "model-00002-of-00002.safetensors",
    "model.layers.28.self_attn.k_proj.weight": "model-00002-of-00002.safetensors",
    "model.layers.28.self_attn.o_proj.bias": "model-00002-of-00002.safetensors",
    "model.layers.28.self_attn.o_proj.weight": "model-00002-of-00002.safetensors",
    "model.layers.28.self_attn.q_proj.bias": "model-00002-of-00002.safetensors",
    "model.layers.28.self_attn.q_proj.weight": "model-00002-of-00002.safetensors",
    "model.layers.28.self_attn.v_proj.bias": "model-00002-of-00002.safetensors",
    "model.layers.28.self_attn.v_proj.weight": "model-00002-of-00002.safetensors",
    "model.layers.29.input_layernorm.bias": "model-00002-of-00002.safetensors",
    "model.layers.29.input_layernorm.weight": "model-00002-of-00002.safetensors",
    "model.layers.29.mlp.c_fc.bias": "model-00002-of-00002.safetensors",
    "model.layers.29.mlp.c_fc.weight": "model-00002-of-00002.safetensors",
    "model.layers.29.mlp.c_proj.bias": "model-00002-of-00002.safetensors",
    "model.layers.29.mlp.c_proj.weight": "model-00002-of-00002.safetensors",
    "model.layers.29.post_attention_layernorm.bias": "model-00002-of-00002.safetensors",
    "model.layers.29.post_attention_layernorm.weight": "model-00002-of-00002.safetensors",
    "model.layers.29.self_attn.k_proj.bias": "model-00002-of-00002.safetensors",
    "model.layers.29.self_attn.k_proj.weight": "model-00002-of-00002.safetensors",
    "model.layers.29.self_attn.o_proj.bias": "model-00002-of-00002.safetensors",
    "model.layers.29.self_attn.o_proj.weight": "model-00002-of-00002.safetensors",
    "model.layers.29.self_attn.q_proj.bias": "model-00002-of-00002.safetensors",
    "model.layers.29.self_attn.q_proj.weight": "model-00002-of-00002.safetensors",
    "model.layers.29.self_attn.v_proj.bias": "model-00002-of-00002.safetensors",
    "model.layers.29.self_attn.v_proj.weight": "model-00002-of-00002.safetensors",
    "model.layers.3.input_layernorm.bias": "model-00001-of-00002.safetensors",
    "model.layers.3.input_layernorm.weight": "model-00001-of-00002.safetensors",
    "model.layers.3.mlp.c_fc.bias": "model-00001-of-00002.safetensors",
    "model.layers.3.mlp.c_fc.weight": "model-00001-of-00002.safetensors",
    "model.layers.3.mlp.c_proj.bias": "model-00001-of-00002.safetensors",
    "model.layers.3.mlp.c_proj.weight": "model-00001-of-00002.safetensors",
    "model.layers.3.post_attention_layernorm.bias": "model-00001-of-00002.safetensors",
    "model.layers.3.post_attention_layernorm.weight": "model-00001-of-00002.safetensors",
    "model.layers.3.self_attn.k_proj.bias": "model-00001-of-00002.safetensors",
    "model.layers.3.self_attn.k_proj.weight": "model-00001-of-00002.safetensors",
    "model.layers.3.self_attn.o_proj.bias": "model-00001-of-00002.safetensors",
    "model.layers.3.self_attn.o_proj.weight": "model-00001-of-00002.safetensors",
    "model.layers.3.self_attn.q_proj.bias": "model-00001-of-00002.safetensors",
    "model.layers.3.self_attn.q_proj.weight": "model-00001-of-00002.safetensors",
    "model.layers.3.self_attn.v_proj.bias": "model-00001-of-00002.safetensors",
    "model.layers.3.self_attn.v_proj.weight": "model-00001-of-00002.safetensors",
    "model.layers.4.input_layernorm.bias": "model-00001-of-00002.safetensors",
    "model.layers.4.input_layernorm.weight": "model-00001-of-00002.safetensors",
    "model.layers.4.mlp.c_fc.bias": "model-00001-of-00002.safetensors",
    "model.layers.4.mlp.c_fc.weight": "model-00001-of-00002.safetensors",
    "model.layers.4.mlp.c_proj.bias": "model-00001-of-00002.safetensors",
    "model.layers.4.mlp.c_proj.weight": "model-00001-of-00002.safetensors",
    "model.layers.4.post_attention_layernorm.bias": "model-00001-of-00002.safetensors",
    "model.layers.4.post_attention_layernorm.weight": "model-00001-of-00002.safetensors",
    "model.layers.4.self_attn.k_proj.bias": "model-00001-of-00002.safetensors",
    "model.layers.4.self_attn.k_proj.weight": "model-00001-of-00002.safetensors",
    "model.layers.4.self_attn.o_proj.bias": "model-00001-of-00002.safetensors",
    "model.layers.4.self_attn.o_proj.weight": "model-00001-of-00002.safetensors",
    "model.layers.4.self_attn.q_proj.bias": "model-00001-of-00002.safetensors",
    "model.layers.4.self_attn.q_proj.weight": "model-00001-of-00002.safetensors",
    "model.layers.4.self_attn.v_proj.bias": "model-00001-of-00002.safetensors",
    "model.layers.4.self_attn.v_proj.weight": "model-00001-of-00002.safetensors",
    "model.layers.5.input_layernorm.bias": "model-00001-of-00002.safetensors",
    "model.layers.5.input_layernorm.weight": "model-00001-of-00002.safetensors",
    "model.layers.5.mlp.c_fc.bias": "model-00001-of-00002.safetensors",
    "model.layers.5.mlp.c_fc.weight": "model-00001-of-00002.safetensors",
    "model.layers.5.mlp.c_proj.bias": "model-00001-of-00002.safetensors",
    "model.layers.5.mlp.c_proj.weight": "model-00001-of-00002.safetensors",
    "model.layers.5.post_attention_layernorm.bias": "model-00001-of-00002.safetensors",
    "model.layers.5.post_attention_layernorm.weight": "model-00001-of-00002.safetensors",
    "model.layers.5.self_attn.k_proj.bias": "model-00001-of-00002.safetensors",
    "model.layers.5.self_attn.k_proj.weight": "model-00001-of-00002.safetensors",
    "model.layers.5.self_attn.o_proj.bias": "model-00001-of-00002.safetensors",
    "model.layers.5.self_attn.o_proj.weight": "model-00001-of-00002.safetensors",
    "model.layers.5.self_attn.q_proj.bias": "model-00001-of-00002.safetensors",
    "model.layers.5.self_attn.q_proj.weight": "model-00001-of-00002.safetensors",
    "model.layers.5.self_attn.v_proj.bias": "model-00001-of-00002.safetensors",
    "model.layers.5.self_attn.v_proj.weight": "model-00001-of-00002.safetensors",
    "model.layers.6.input_layernorm.bias": "model-00001-of-00002.safetensors",
    "model.layers.6.input_layernorm.weight": "model-00001-of-00002.safetensors",
    "model.layers.6.mlp.c_fc.bias": "model-00001-of-00002.safetensors",
    "model.layers.6.mlp.c_fc.weight": "model-00001-of-00002.safetensors",
    "model.layers.6.mlp.c_proj.bias": "model-00001-of-00002.safetensors",
    "model.layers.6.mlp.c_proj.weight": "model-00001-of-00002.safetensors",
    "model.layers.6.post_attention_layernorm.bias": "model-00001-of-00002.safetensors",
    "model.layers.6.post_attention_layernorm.weight": "model-00001-of-00002.safetensors",
    "model.layers.6.self_attn.k_proj.bias": "model-00001-of-00002.safetensors",
    "model.layers.6.self_attn.k_proj.weight": "model-00001-of-00002.safetensors",
    "model.layers.6.self_attn.o_proj.bias": "model-00001-of-00002.safetensors",
    "model.layers.6.self_attn.o_proj.weight": "model-00001-of-00002.safetensors",
    "model.layers.6.self_attn.q_proj.bias": "model-00001-of-00002.safetensors",
    "model.layers.6.self_attn.q_proj.weight": "model-00001-of-00002.safetensors",
    "model.layers.6.self_attn.v_proj.bias": "model-00001-of-00002.safetensors",
    "model.layers.6.self_attn.v_proj.weight": "model-00001-of-00002.safetensors",
    "model.layers.7.input_layernorm.bias": "model-00001-of-00002.safetensors",
    "model.layers.7.input_layernorm.weight": "model-00001-of-00002.safetensors",
    "model.layers.7.mlp.c_fc.bias": "model-00001-of-00002.safetensors",
    "model.layers.7.mlp.c_fc.weight": "model-00001-of-00002.safetensors",
    "model.layers.7.mlp.c_proj.bias": "model-00001-of-00002.safetensors",
    "model.layers.7.mlp.c_proj.weight": "model-00001-of-00002.safetensors",
    "model.layers.7.post_attention_layernorm.bias": "model-00001-of-00002.safetensors",
    "model.layers.7.post_attention_layernorm.weight": "model-00001-of-00002.safetensors",
    "model.layers.7.self_attn.k_proj.bias": "model-00001-of-00002.safetensors",
    "model.layers.7.self_attn.k_proj.weight": "model-00001-of-00002.safetensors",
    "model.layers.7.self_attn.o_proj.bias": "model-00001-of-00002.safetensors",
    "model.layers.7.self_attn.o_proj.weight": "model-00001-of-00002.safetensors",
    "model.layers.7.self_attn.q_proj.bias": "model-00001-of-00002.safetensors",
    "model.layers.7.self_attn.q_proj.weight": "model-00001-of-00002.safetensors",
    "model.layers.7.self_attn.v_proj.bias": "model-00001-of-00002.safetensors",
    "model.layers.7.self_attn.v_proj.weight": "model-00001-of-00002.safetensors",
    "model.layers.8.input_layernorm.bias": "model-00001-of-00002.safetensors",
    "model.layers.8.input_layernorm.weight": "model-00001-of-00002.safetensors",
    "model.layers.8.mlp.c_fc.bias": "model-00001-of-00002.safetensors",
    "model.layers.8.mlp.c_fc.weight": "model-00001-of-00002.safetensors",
    "model.layers.8.mlp.c_proj.bias": "model-00001-of-00002.safetensors",
    "model.layers.8.mlp.c_proj.weight": "model-00001-of-00002.safetensors",
    "model.layers.8.post_attention_layernorm.bias": "model-00001-of-00002.safetensors",
    "model.layers.8.post_attention_layernorm.weight": "model-00001-of-00002.safetensors",
    "model.layers.8.self_attn.k_proj.bias": "model-00001-of-00002.safetensors",
    "model.layers.8.self_attn.k_proj.weight": "model-00001-of-00002.safetensors",
    "model.layers.8.self_attn.o_proj.bias": "model-00001-of-00002.safetensors",
    "model.layers.8.self_attn.o_proj.weight": "model-00001-of-00002.safetensors",
    "model.layers.8.self_attn.q_proj.bias": "model-00001-of-00002.safetensors",
    "model.layers.8.self_attn.q_proj.weight": "model-00001-of-00002.safetensors",
    "model.layers.8.self_attn.v_proj.bias": "model-00001-of-00002.safetensors",
    "model.layers.8.self_attn.v_proj.weight": "model-00001-of-00002.safetensors",
    "model.layers.9.input_layernorm.bias": "model-00001-of-00002.safetensors",
    "model.layers.9.input_layernorm.weight": "model-00001-of-00002.safetensors",
    "model.layers.9.mlp.c_fc.bias": "model-00001-of-00002.safetensors",
    "model.layers.9.mlp.c_fc.weight": "model-00001-of-00002.safetensors",
    "model.layers.9.mlp.c_proj.bias": "model-00001-of-00002.safetensors",
    "model.layers.9.mlp.c_proj.weight": "model-00001-of-00002.safetensors",
    "model.layers.9.post_attention_layernorm.bias": "model-00001-of-00002.safetensors",
    "model.layers.9.post_attention_layernorm.weight": "model-00001-of-00002.safetensors",
    "model.layers.9.self_attn.k_proj.bias": "model-00001-of-00002.safetensors",
    "model.layers.9.self_attn.k_proj.weight": "model-00001-of-00002.safetensors",
    "model.layers.9.self_attn.o_proj.bias": "model-00001-of-00002.safetensors",
    "model.layers.9.self_attn.o_proj.weight": "model-00001-of-00002.safetensors",
    "model.layers.9.self_attn.q_proj.bias": "model-00001-of-00002.safetensors",
    "model.layers.9.self_attn.q_proj.weight": "model-00001-of-00002.safetensors",
    "model.layers.9.self_attn.v_proj.bias": "model-00001-of-00002.safetensors",
    "model.layers.9.self_attn.v_proj.weight": "model-00001-of-00002.safetensors",
    "model.norm.bias": "model-00002-of-00002.safetensors",
    "model.norm.weight": "model-00002-of-00002.safetensors"
  }
}
