{
  "architectures": [
    "Starcoder2ForCausalLM"
  ],
  "attention_dropout": 0.1,
  "bos_token_id": 0,
  "dtype": "float32",
  "embedding_dropout": 0.1,
  "eos_token_id": 0,
  "hidden_act": "gelu_pytorch_tanh",
  "hidden_size": 3072,
  "initializer_range": 0.018042,
  "intermediate_size": 12288,
  "max_position_embeddings": 16384,
  "mlp_type": "default",
  "model_type": "starcoder2",
  "norm_epsilon": 1e-05,
  "norm_type": "layer_norm",
  "num_attention_heads": 24,
  "num_hidden_layers": 30,
  "num_key_value_heads": 2,
  "residual_dropout": 0.1,
  "rope_scaling": null,
  "rope_theta": 999999.4420358813,
  "sliding_window": 4096,
  "transformers_version": "4.57.1",
  "use_bias": true,
  "use_cache": true,
  "vocab_size": 49152
}
